[
{"title": "P (2005) - full transcript", "plot": "Whilst growing up in rural Thailand, a young orphan girl is taught the ways of magic by her grandmother. But when grandmother falls sick, Dau is lured to Bangkok to find work so that she can buy medicine. She finds herself working in a go-go bar, and her journey from naiveté to maturity is swift. She uses the magical skills her grandmother taught her to her advantage, but in doing so makes enemies within the bar. As her magic gets darker, and the consequences increasingly horrific, she gradually loses control, and something evil takes over.", "url": "https://subslikescript.com/movie/P-449629"},
{"title": "P Like Pelican (1972) - full transcript", "plot": "An old hermit lives in a slum and wants to teach the alphabet to the children regularly go there to play. What makes the hermit happiest however, is when he comes to the letter P (for \"Pedarsag\", or \"Puppy\"). When a child proposes he use the word \"Pelican\" instead, the hermit goes to the nearby park looking for this animal he has never heard of.", "url": "https://subslikescript.com/movie/P_Like_Pelican-206994"},
{"title": "P!nk: Beautiful Trauma (2017) - full transcript", "plot": "\"Beautiful Trauma\" is a song by American singer-songwriter Pink. The song was written by Pink and Jack Antonoff, with production handled by Antonoff. On November 21, 2017, a music video for...", "url": "https://subslikescript.com/movie/Pnk_Beautiful_Trauma-7699354"},
{"title": "P.I. Private Investigations (1987) - full transcript", "plot": "A young architect finds himself being stalked by a gang of criminals who believe he knows something that could expose their activities.", "url": "https://subslikescript.com/movie/PI_Private_Investigations-93784"},
{"title": "P Storm (2019) - full transcript", "plot": "William Luk, goes undercover as a prisoner to investigate correctional officers who are receiving bribes.", "url": "https://subslikescript.com/movie/P_Storm-10017680"},
{"title": "P.C.H. (1995) - full transcript", "plot": "Out at Pacific Coast University, five students living in the same apartment building go through personal trials. Stacey was a famous volleyball player and fashion model once; now she's in ...", "url": "https://subslikescript.com/movie/PCH-170348"},
{"title": "P.O.V. (2009) - full transcript", "plot": null, "url": "https://subslikescript.com/movie/POV-1249439"},
{"title": "P.S. Girls (2016) - full transcript", "plot": "Eun-joo dreams of being a plastic surgery specialist while she works as a nurse. At night, she has a job as Nabi, having sex on the phone to come up with money for her dad's medical bills. La Belle's madam Big Mama pays her girls in advance and forces them to do sexual activities like body cams while she rips them off their money. At La Belle are Candy, Cherry, Eunmi and other girls with stories but have sex on the phone with men. Meanwhile, Joon-ho, Eun-joo's hospital director starts showing interest in Eun-joo who looks like his dead wife and they develop a romantic relationship. However, Eun-joo doesn't open up to him so he starts to feel disappointed. Joon-ho starts getting obssessed with her the more she pushes away from him until one day he sees her going to her night job. He watches her from afar. In-ik, a nurse at a cosmetic surgery clinic, finds out about Eun-joo and Joon-ho and gets jealous. Then one day, Eun-joo is having phone sex when she gets a weird call and feels as if someone is watching her.", "url": "https://subslikescript.com/movie/PS_Girls-8969990"},
{"title": "P.J. (1968) - full transcript", "plot": "Private eye P.J. is reluctant when he gets a new job: he shall protect Maureen Preble, mistress of millionaire Orbeson, mainly from attacks by his wife and her greedy family. In truth Orbeson plans a deadly intrigue in which P.J. is to play a central part. Meanwhile P.J. falls in love with Maureen and Orbeson's money.", "url": "https://subslikescript.com/movie/PJ-63402"},
{"title": "P2 (2007) - full transcript", "plot": "The story centers on a corporate climber who gets stuck working late on Christmas Eve and finds herself the target of an unhinged security guard. With no help in sight, the woman must overcome physical and psychological challenges to survive.", "url": "https://subslikescript.com/movie/P2-804516"},
{"title": "P.U.N.K.S. (1999) - full transcript", "plot": "A group of misfit teens evade a corrupt scientist when they steal and attempt to return a suit that delivers supernatural strength to its wearer.", "url": "https://subslikescript.com/movie/PUNKS-130172"},
{"title": "P90X (Power 90 Extreme) (2004) - full transcript", "plot": "P90X (Power 90 Extreme) is the sequel to Beachbody's Power 90. This is a workout program featuring trainer Tony Horton. The workout program contains a number of cardiovascular and resistance based exercises that the creators' claim will get you \"Ripped\" in 90 days.", "url": "https://subslikescript.com/movie/P90X_Power_90_Extreme-1690995"},
{"title": "Pa-la Pa-la ying ji fa (2001) - full transcript", "plot": "Phillip, a dance instructor who holds a class devoted to the latest dance craze, Para Para. While in Shanghai, Phillip meets Yee, a spoiled rich girl who is running away from her impending arranged marriage. Soon, Yee begins using Phillip's dance studio as a sanctuary from her responsibilities, and an attraction begins to form between the two. However, Yee is called back to Japan to be married before long, and Phillip must use more than his dance skills and charisma to prevent her from taking her vows.", "url": "https://subslikescript.com/movie/Pa-la_Pa-la_ying_ji_fa-293895"},
{"title": "På liv och död (1943) - full transcript", "plot": "A train accident in northern Sweden is possibly a sabotage.", "url": "https://subslikescript.com/movie/P_liv_och_dd-36283"},
{"title": "P.S. I Love You (2007) - full transcript", "plot": "Holly Kennedy is beautiful, smart and married to the love of her life - a passionate, funny, and impetuous Irishman named Gerry. So when Gerry's life is taken by an illness, it takes the life out of Holly. The only one who can help her is the person who is no longer there. Nobody knows Holly better than Gerry. So it's a good thing he planned ahead. Before he died, Gerry wrote Holly a series of letters that will guide her, not only through her grief, but in rediscovering herself. The first message arrives on Holly's 30th birthday in the form of a cake, and to her utter shock, a tape recording from Gerry, who proceeds to tell her to get out and \"celebrate herself\". In the weeks and months that follow, more letters from Gerry are delivered in surprising ways, each sending her on a new adventure and each signing off in the same way; P.S. I Love You. Holly's mother and best friends begin to worry that Gerry's letters are keeping Holly tied to the past, but in fact, each letter is pushing her further into a new future. With Gerry's words as her guide, Holly embarks on a journey of rediscovery in a story about marriage, friendship and how a love so strong can turn the finality of death into a new beginning for life.", "url": "https://subslikescript.com/movie/PS_I_Love_You-431308"},
{"title": "Pa Happy She Ta Yer (2015) - full transcript", "plot": "Miss Happy stars Pancake Khemanit as a happy-go-lucky woman named Happy, who often annoys her best friend Golfie (Ben Chalatit). Unfortunately, Happy is diagnosed with having an irregular heartbeat that will likely cause her death within a month. In an effort to survive, Happy looks up information and finds a YouTube video made by Tul, played by Jitpanu Klomkaew (Ball). Tul's video claims that Happy can stay alive if she dances in the way shown in the video.", "url": "https://subslikescript.com/movie/Pa_Happy_She_Ta_Yer-4705660"},
{"title": "Pachamama (2018) - full transcript", "plot": "A young boy living in a remote village in the Andes Mountains dreams of becoming shaman.", "url": "https://subslikescript.com/movie/Pachamama-5541002"},
{"title": "Pachamama - Unsere Erde (1995) - full transcript", "plot": null, "url": "https://subslikescript.com/movie/Pachamama_-_Unsere_Erde-210213"},
{"title": "Pacific Adventure (1946) - full transcript", "plot": "An Australian biopic about the life of pioneering aviator Charles \"Smithy\" Kingsford-Smith.", "url": "https://subslikescript.com/movie/Pacific_Adventure-38954"}
]